DeatakCZ/STM32/StandAlone/G050K8/07_RelayBoard_V3_Cursor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TEMP_1_Pin GPIO_PIN_0
#define TEMP_1_GPIO_Port GPIOA
#define TEMP_REF_Pin GPIO_PIN_1
#define TEMP_REF_GPIO_Port GPIOA
#define TEMP_2_Pin GPIO_PIN_2
#define TEMP_2_GPIO_Port GPIOA
#define LM35_Pin GPIO_PIN_3
#define LM35_GPIO_Port GPIOA
#define DIP_DATA_Pin GPIO_PIN_0
#define DIP_DATA_GPIO_Port GPIOB
#define DIP_LATCH_Pin GPIO_PIN_1
#define DIP_LATCH_GPIO_Port GPIOB
#define DIP_CLOCK_Pin GPIO_PIN_2
#define DIP_CLOCK_GPIO_Port GPIOB
#define RELAY_2_Pin GPIO_PIN_11
#define RELAY_2_GPIO_Port GPIOA
#define RELAY_1_Pin GPIO_PIN_12
#define RELAY_1_GPIO_Port GPIOA
#define BTN_2_Pin GPIO_PIN_3
#define BTN_2_GPIO_Port GPIOB
#define BTN_2_EXTI_IRQn EXTI2_3_IRQn
#define BTN_1_Pin GPIO_PIN_4
#define BTN_1_GPIO_Port GPIOB
#define BTN_1_EXTI_IRQn EXTI4_15_IRQn
#define SW_1_Pin GPIO_PIN_5
#define SW_1_GPIO_Port GPIOB
#define SW_1_EXTI_IRQn EXTI4_15_IRQn
#define SW_2_Pin GPIO_PIN_6
#define SW_2_GPIO_Port GPIOB
#define SW_2_EXTI_IRQn EXTI4_15_IRQn
#define TEMP_LED_Pin GPIO_PIN_7
#define TEMP_LED_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
